sterentev/atdf-device-asm-include/inc/ATmega32M1.inc
; ----------	Register TCCR1C bits		------------------------
.equ	FOC1A		= 7		; 0x80 - Force Output Compare for Channel A
.equ	FOC1B		= 6		; 0x40 - Force Output Compare for Channel B

; ----------	Register GTCCR bits		------------------------
;.equ	TSM		= 7		; 0x80 - Timer/Counter Synchronization Mode
;.equ	ICPSEL1		= 6		; 0x40 - Timer/Counter1 Input Capture Selection
;.equ	PSRSYNC		= 0		; 0x01 - Timer/Counter Prescaler Reset



; ====	ADC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ADMUX bits		------------------------
.equ	REFS_MASK	= 0xC0		;      - Reference Selection Bits (2 bits)
.equ	REFS0		= 6		;          REFS BIT0 position
.equ	ADLAR		= 5		; 0x20 - Left Adjust Result
.equ	MUX_MASK	= 0x1F		;      - ADC channel selection bits (5 bits)
.equ	MUX0		= 0		;          MUX BIT0 position
; ::::  REFS	:::: bitfield values
;			0x00		; AREF, Internal Vref turned off
;			0x40		; AVCC reference
;			0x80		; Reserved
;			0xC0		; Internal 2.56V Voltage Reference
; ::::  MUX	:::: bitfield values
;			0x00		; ADC input pin 0
;			0x01		; ADC input pin 1
;			0x02		; ADC input pin 2
;			0x03		; ADC input pin 3
;			0x04		; ADC input pin 4
;			0x05		; ADC input pin 5
;			0x06		; ADC input pin 6
;			0x07		; ADC input pin 7
;			0x08		; ADC input pin 8
;			0x09		; ADC input pin 9
;			0x0A		; ADC input pin 10
;			0x0B		; Temperature sensor
;			0x0C		; Internal VCC / 4
;			0x0D		; Current source
;			0x0E		; Analog Differential Amplifier 0
;			0x0F		; Analog Differential Amplifier 1
;			0x10		; Analog Differential Amplifier 2
;			0x11		; Bandgap
;			0x12		; 0V (GND)

; ----------	Register ADCSRA bits		------------------------
.equ	ADEN		= 7		; 0x80 - ADC Enable
.equ	ADSC		= 6		; 0x40 - ADC Start Conversion
.equ	ADATE		= 5		; 0x20 - ADC Auto Trigger Enable
.equ	ADIF		= 4		; 0x10 - ADC Interrupt Flag
.equ	ADIE		= 3		; 0x08 - ADC Interrupt Enable
.equ	ADPS_MASK	= 0x07		;      - ADC  Prescaler Select Bits (3 bits)
.equ	ADPS0		= 0		;          ADPS BIT0 position

; ----------	Register ADCSRB bits		------------------------
.equ	ADHSM		= 7		; 0x80 - ADC High Speed Mode
.equ	ISRCEN		= 6		; 0x40 - Current Source Enable
.equ	AREFEN		= 5		; 0x20 - Analog Reference pin Enable
.equ	ADTS_MASK	= 0x0F		;      - ADC Auto Trigger Sources (4 bits)
.equ	ADTS0		= 0		;          ADTS BIT0 position
; ::::  ADTS	:::: bitfield values
;			0x00		; Free Running mode
;			0x01		; Analog Comparator
;			0x02		; External Interrupt Request 0
;			0x03		; Timer/Counter0 Compare Match A
;			0x04		; Timer/Counter0 Overflow
;			0x05		; Timer/Counter1 Compare Match B
;			0x06		; Timer/Counter1 Overflow
;			0x07		; Timer/Counter1 Capture Event
;			0x08		; PSC0ASY Event
;			0x09		; PSC1ASY Event
;			0x0A		; PSC2ASY Event
;			0x0B		; Analog comparator 1
;			0x0C		; Analog comparator 2

; ----------	Register DIDR0 bits		------------------------
.equ	ADC7D		= 7		; 0x80 - ADC7 Digital input Disable
.equ	ADC6D		= 6		; 0x40 - ADC6 Digital input Disable
.equ	ADC5D		= 5		; 0x20 - ADC5 Digital input Disable
.equ	ADC4D		= 4		; 0x10 - ADC4 Digital input Disable
.equ	ADC3D		= 3		; 0x08 - ADC3 Digital input Disable
.equ	ADC2D		= 2		; 0x04 - ADC2 Digital input Disable
.equ	ADC1D		= 1		; 0x02 - ADC1 Digital input Disable
.equ	ADC0D		= 0		; 0x01 - ADC0 Digital input Disable

; ----------	Register DIDR1 bits		------------------------
.equ	AMP2PD		= 6		; 0x40 - AMP2P Pin Digital input Disable
.equ	ACMP0D		= 5		; 0x20 - ACMP0 Pin Digital input Disable
.equ	AMP0PD		= 4		; 0x10 - AMP0P Pin Digital input Disable
.equ	AMP0ND		= 3		; 0x08 - AMP0N Pin Digital input Disable
.equ	ADC10D		= 2		; 0x04 - ADC10 Pin Digital input Disable
.equ	ADC9D		= 1		; 0x02 - ADC9 Pin Digital input Disable
.equ	ADC8D		= 0		; 0x01 - ADC8 Pin Digital input Disable

; ----------	Register AMP0CSR bits		------------------------
.equ	AMP0EN		= 7		; 0x80 - Amplifier 0 Enable
.equ	AMP0IS		= 6		; 0x40 - Amplifier 0 Input Shunt
.equ	AMP0G_MASK	= 0x30		;      - Amplifier 0 Gain Selection (2 bits)
.equ	AMP0G0		= 4		;          AMP0G BIT0 position
.equ	AMPCMP0		= 3		; 0x08 - Amplifier 0 - Comparator 0 connection
.equ	AMP0TS_MASK	= 0x07		;      - Amplifier 0 Clock Source Selection (3 bits)
.equ	AMP0TS0		= 0		;          AMP0TS BIT0 position

; ----------	Register AMP1CSR bits		------------------------
.equ	AMP1EN		= 7		; 0x80 - Amplifier 1 Enable
.equ	AMP1IS		= 6		; 0x40 - Amplifier 1 Input Shunt
.equ	AMP1G_MASK	= 0x30		;      - Amplifier 1 Gain Selection (2 bits)
.equ	AMP1G0		= 4		;          AMP1G BIT0 position
.equ	AMPCMP1		= 3		; 0x08 - Amplifier 1 - Comparator 1 Connection
.equ	AMP1TS_MASK	= 0x07		;      - Amplifier 1 Clock Source Selection (3 bits)
.equ	AMP1TS0		= 0		;          AMP1TS BIT0 position

; ----------	Register AMP2CSR bits		------------------------
.equ	AMP2EN		= 7		; 0x80 - Amplifier 2 Enable
.equ	AMP2IS		= 6		; 0x40 - Amplifier 2 Input Shunt
.equ	AMP2G_MASK	= 0x30		;      - Amplifier 2 Gain Selection (2 bits)
.equ	AMP2G0		= 4		;          AMP2G BIT0 position
.equ	AMPCMP2		= 3		; 0x08 - Amplifier 2 - Comparator 2 Connection
.equ	AMP2TS_MASK	= 0x07		;      - Amplifier 2 Clock Source Selection (3 bits)
.equ	AMP2TS0		= 0		;          AMP2TS BIT0 position



; ====	LINUART MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LINCR bits		------------------------
.equ	LSWRES		= 7		; 0x80 - Software Reset
.equ	LIN13		= 6		; 0x40 - LIN Standard
.equ	LCONF_MASK	= 0x30		;      - LIN Configuration bits (2 bits)
.equ	LCONF0		= 4		;          LCONF BIT0 position
.equ	LENA		= 3		; 0x08 - LIN or UART Enable
.equ	LCMD_MASK	= 0x07		;      - LIN Command and Mode bits (3 bits)
.equ	LCMD0		= 0		;          LCMD BIT0 position

; ----------	Register LINSIR bits		------------------------
.equ	LIDST_MASK	= 0xE0		;      - Identifier Status bits (3 bits)
.equ	LIDST0		= 5		;          LIDST BIT0 position
.equ	LBUSY		= 4		; 0x10 - Busy Signal
.equ	LERR		= 3		; 0x08 - Error Interrupt
.equ	LIDOK		= 2		; 0x04 - Identifier Interrupt
.equ	LTXOK		= 1		; 0x02 - Transmit Performed Interrupt
.equ	LRXOK		= 0		; 0x01 - Receive Performed Interrupt

; ----------	Register LINENIR bits		------------------------
.equ	LENERR		= 3		; 0x08 - Enable Error Interrupt
.equ	LENIDOK		= 2		; 0x04 - Enable Identifier Interrupt
.equ	LENTXOK		= 1		; 0x02 - Enable Transmit Performed Interrupt
.equ	LENRXOK		= 0		; 0x01 - Enable Receive Performed Interrupt

; ----------	Register LINERR bits		------------------------
.equ	LABORT		= 7		; 0x80 - Abort Flag
.equ	LTOERR		= 6		; 0x40 - Frame Time Out Error Flag
.equ	LOVERR		= 5		; 0x20 - Overrun Error Flag
.equ	LFERR		= 4		; 0x10 - Framing Error Flag
.equ	LSERR		= 3		; 0x08 - Synchronization Error Flag
.equ	LPERR		= 2		; 0x04 - Parity Error Flag
.equ	LCERR		= 1		; 0x02 - Checksum Error Flag
.equ	LBERR		= 0		; 0x01 - Bit Error Flag

; ----------	Register LINBTR bits		------------------------
.equ	LDISR		= 7		; 0x80 - Disable Bit Timing Resynchronization
.equ	LBT_MASK	= 0x3F		;      - LIN Bit Timing bits (6 bits)
.equ	LBT0		= 0		;          LBT BIT0 position

; ----------	Register LINBRR bits		------------------------
.equ	LDIV_MASK	= 0x0FFF	;      -  (12 bits)
.equ	LDIV0		= 0		;          LDIV BIT0 position

; ----------	Register LINDLR bits		------------------------
.equ	LTXDL_MASK	= 0xF0		;      - LIN Transmit Data Length bits (4 bits)
.equ	LTXDL0		= 4		;          LTXDL BIT0 position
.equ	LRXDL_MASK	= 0x0F		;      - LIN Receive Data Length bits (4 bits)
.equ	LRXDL0		= 0		;          LRXDL BIT0 position

